{
  "backend/main.mo": "Implements access-controlled user profiles and lead management with public lead submission and admin-only retrieval.",
  "feature_evidence.json": "Contains feature evidence metadata mapping features to related files, components, and tests.",
  "frontend-file-summaries.txt": "Provides predefined short summaries for various frontend source files.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "HTML entry point defining root container and loading the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router with all site pages wrapped in a shared layout.",
  "frontend/src/components/SiteFooter.tsx": "Footer component with business info, contact details, social links, and attribution.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with branding and navigation for desktop and mobile.",
  "frontend/src/components/SiteLayout.tsx": "Layout wrapper that renders the header, page content, and footer.",
  "frontend/src/hooks/useActor.ts": "React hook creating an authenticated or anonymous backend actor and refreshing queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status flags.",
  "frontend/src/hooks/useSeo.ts": "Custom hook that sets the document title and meta description tags.",
  "frontend/src/hooks/useSubmitContactInquiry.ts": "React Query mutation hook that submits contact form data via an actor and invalidates the leads query on success.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, global styles, dark mode values, and utility classes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Page displaying company information with branding, metrics, and SEO metadata setup.",
  "frontend/src/pages/ContactPage.tsx": "Page with a contact form, client-side validation, submission via mutation, WhatsApp link, and success state UI.",
  "frontend/src/pages/GalleryPage.tsx": "Image gallery page with lightbox dialogs and SEO metadata.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a hero section, navigation buttons, highlights, and SEO metadata.",
  "frontend/src/pages/MenuPage.tsx": "Renders a menu page with SEO metadata, tabbed categories, and item lists styled using cards and Tailwind classes.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a services page with SEO setup and a grid of service cards each showing an icon, title, and description.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and theme settings for the site's maroon‑and‑gold design system.",
  "project_state.json": "Tracks project metadata, design requirements, features, and image assets for the Royal Bikana Caterers website build."
}