{
  "backend/main.mo": "Actor providing user profiles with access control plus lead submission and admin-only lead retrieval.",
  "feature_evidence.json": "Feature evidence describing gallery update requirements and referencing GalleryPage.tsx.",
  "frontend-file-summaries.txt": "Text file containing short summaries of multiple frontend source files.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with six pages wrapped in SiteLayout.",
  "frontend/src/components/SiteFooter.tsx": "Footer with business info, contact details, social links, and attribution.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with logo, desktop navigation, and mobile sheet menu.",
  "frontend/src/components/SiteLayout.tsx": "Layout wrapper including header, footer, and main content area.",
  "frontend/src/hooks/useActor.ts": "Hook creating backend actor based on Internet Identity and refreshing queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login and stored identities.",
  "frontend/src/hooks/useSeo.ts": "Hook that updates page title and meta description.",
  "frontend/src/hooks/useSubmitContactInquiry.ts": "Mutation hook submitting contact form data to backend and invalidating lead queries.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light and dark mode, base typography, and a utility background pattern class.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About Us page with branding, company description, stats, and SEO metadata.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, inquiry submission, WhatsApp link, success UI, and SEO setup.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a gallery grid of catering images with modal previews and SEO metadata.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage with hero section, navigation buttons, highlights, and SEO metadata.",
  "frontend/src/pages/MenuPage.tsx": "Provides a categorized menu using tabbed UI and SEO metadata for the catering offerings.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the Services page with SEO settings and a grid of service cards using predefined icons and descriptions.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, and clearing URL and sessionStorage parameters, including hash-based parsing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and plugins for the project's custom theme.",
  "project_state.json": "Contains project metadata, requirements, features, and architectural notes for the Royal Bikana Caterers website."
}